Prettier graph
