--- a/README.md
+++ b/README.md
@@ -54,87 +59,36 @@ Any other proofs in the selected UCAN not issued by the same DID as the revocati
-### 6.6.1 Example
+## 6.6.1 Example
 
-```
-               Root
-        ┌────────────────┐          ─┐
-        │                │           │
-        │  iss: Alice    │           │
-        │  aud: Bob      │           ├─ Alice can revoke
-        │                │           │
-        └───┬────────┬───┘           │
-            │        │               │
-            │        │               │
-            ▼        ▼               │
-┌──────────────┐  ┌──────────────┐   │  ─┐
-│              │  │              │   │   │
-│  iss: Bob    │  │  iss: Bob    │   │   │
-│  aud: Carol  │  │  aud: Dan    │   │   ├─ Bob can revoke
-│  cap: [X,Y]  │  │  cap: [Y,Z]  │   │   │
-│              │  │              │   │   │
-└───────┬──────┘  └──┬───────────┘   │   │
-        │            │               │   │
-        │            │               │   │
-        ▼            │               │   │
-┌──────────────┐     │               │   │  ─┐
-│              │     │               │   │   │
-│  iss: Carol  │     │               │   │   │
-│  aud: Dan    │     │               │   │   ├─ Carol can revoke
-│  cap: [X,Y]  │     │               │   │   │
-│              │     │               │   │   │
-└───────────┬──┘     │               │   │   │
-            │        │               │   │   │
-            │        │               │   │   │
-            ▼        ▼               │   │   │
-        ┌────────────────┐           │   │   │  ─┐
-        │                │           │   │   │   │
-        │  iss: Dan      │           │   │   │   │
-        │  aud: Erin     │           │   │   │   ├─ Dan can revoke
-        │  cap: [X,Y,Z]  │           │   │   │   │
-        │                │           │   │   │   │
-        └────────────────┘          ─┘  ─┘  ─┘  ─┘
+``` mermaid
+flowchart TB
+    subgraph RA[Alice can revoke]
+        AB["(Root)\niss: Alice\naud: Bob\ncap:[X,Y,Z]"]
+
+        subgraph RB[Bob can revoke]
+            BC["iss: Bob\naud: Carol\ncap: [X,Y]"]
+            BD["iss: Bob\naud: Dan\ncap:[Y,Z]"]
+
+            subgraph RC[Carol can revoke]
+                CD["iss: Carol\naud: Dan\ncap:[X,Y]"]
+
+                subgraph RD[Dan can revoke]
+                    DE["iss: Dan\naud: Erin\ncap:[X,Y,Z]"]
+                end
+            end
+        end
+    end
+
+    BD -->|proof| AB
+    BC -->|proof| AB
+    CD -->|proof| BC
+    DE -->|proof| CD
+    DE -->|proof| BD
 ```
 
 In this example, Alice MAY revoke any of the UCANs in the chain, Carol MAY revoke the bottom two, and so on. If the UCAN `Carol → Dan` is revoked by Alice, Bob, or Carol, then Erin will not have a valid chain for `X` since its proof is invalid. However, Erin can still prove the valid capability for `Y` and `Z` since the still-valid ("unbroken") chain `Alice → Bob → Dan → Erin` includes them. Note that despite `Y` being in the revoked `Carol → Dan` UCAN, it does not invalidate `Y` for Erin, since the unbroken chain also included a proof for `Y`. 
 
